src/main/java/ok/dht/test/ushkov/report/stage4/profiles/2022-10-26-18-11-11_notag_put_t4_c64_R10000_d1m/wrk2.txt
Running 1m test @ http://localhost:1337
  4 threads and 64 connections
  Thread calibration: mean lat.: 1330.255ms, rate sampling interval: 7970ms
  Thread calibration: mean lat.: 1342.641ms, rate sampling interval: 8019ms
  Thread calibration: mean lat.: 1343.574ms, rate sampling interval: 8011ms
  Thread calibration: mean lat.: 1360.425ms, rate sampling interval: 8105ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.02s     9.88s   41.58s    58.03%
    Req/Sec   722.54    272.56     1.26k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.36s 
 75.000%   31.80s 
 90.000%   37.39s 
 99.000%   40.80s 
 99.900%   41.29s 
 99.990%   41.48s 
 99.999%   41.58s 
100.000%   41.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5361.663     0.000000            1         1.00
    9666.559     0.100000        14415         1.11
   13238.271     0.200000        28792         1.25
   17186.815     0.300000        43228         1.43
   25018.367     0.400000        58042         1.67
   25362.431     0.500000        72415         2.00
   25526.271     0.550000        79388         2.22
   26279.935     0.600000        86371         2.50
   28114.943     0.650000        93597         2.86
   29982.719     0.700000       100779         3.33
   31801.343     0.750000       107976         4.00
   32718.847     0.775000       111562         4.44
   33685.503     0.800000       115164         5.00
   34635.775     0.825000       118793         5.71
   35586.047     0.850000       122350         6.67
   36503.551     0.875000       126071         8.00
   36896.767     0.887500       127739         8.89
   37388.287     0.900000       129645        10.00
   37847.039     0.912500       131420        11.43
   38305.791     0.925000       133228        13.33
   38764.543     0.937500       134974        16.00
   38993.919     0.943750       135838        17.78
   39256.063     0.950000       136811        20.00
   39485.439     0.956250       137665        22.86
   39747.583     0.962500       138655        26.67
   39976.959     0.968750       139557        32.00
   40075.263     0.971875       139938        35.56
   40206.335     0.975000       140431        40.00
   40304.639     0.978125       140797        45.71
   40435.711     0.981250       141292        53.33
   40566.783     0.984375       141767        64.00
   40632.319     0.985938       142007        71.11
   40697.855     0.987500       142235        80.00
   40763.391     0.989062       142472        91.43
   40796.159     0.990625       142586       106.67
   40861.695     0.992188       142807       128.00
   40927.231     0.992969       143015       142.22
   40959.999     0.993750       143112       160.00
   40992.767     0.994531       143203       182.86
   41025.535     0.995313       143297       213.33
   41058.303     0.996094       143392       256.00
   41091.071     0.996484       143464       284.44
   41123.839     0.996875       143533       320.00
   41156.607     0.997266       143599       365.71
   41156.607     0.997656       143599       426.67
   41189.375     0.998047       143654       512.00
   41222.143     0.998242       143709       568.89
   41222.143     0.998437       143709       640.00
   41254.911     0.998633       143760       731.43
   41287.679     0.998828       143805       853.33
   41287.679     0.999023       143805      1024.00
   41287.679     0.999121       143805      1137.78
   41320.447     0.999219       143836      1280.00
   41320.447     0.999316       143836      1462.86
   41353.215     0.999414       143866      1706.67
   41353.215     0.999512       143866      2048.00
   41385.983     0.999561       143887      2275.56
   41385.983     0.999609       143887      2560.00
   41385.983     0.999658       143887      2925.71
   41418.751     0.999707       143902      3413.33
   41418.751     0.999756       143902      4096.00
   41418.751     0.999780       143902      4551.11
   41451.519     0.999805       143909      5120.00
   41451.519     0.999829       143909      5851.43
   41484.287     0.999854       143917      6826.67
   41484.287     0.999878       143917      8192.00
   41484.287     0.999890       143917      9102.22
   41484.287     0.999902       143917     10240.00
   41517.055     0.999915       143924     11702.86
   41517.055     0.999927       143924     13653.33
   41517.055     0.999939       143924     16384.00
   41517.055     0.999945       143924     18204.44
   41517.055     0.999951       143924     20480.00
   41549.823     0.999957       143928     23405.71
   41549.823     0.999963       143928     27306.67
   41549.823     0.999969       143928     32768.00
   41549.823     0.999973       143928     36408.89
   41549.823     0.999976       143928     40960.00
   41549.823     0.999979       143928     46811.43
   41582.591     0.999982       143930     54613.33
   41582.591     0.999985       143930     65536.00
   41582.591     0.999986       143930     72817.78
   41582.591     0.999988       143930     81920.00
   41582.591     0.999989       143930     93622.86
   41582.591     0.999991       143930    109226.67
   41582.591     0.999992       143930    131072.00
   41615.359     0.999993       143931    145635.56
   41615.359     1.000000       143931          inf
#[Mean    =    24021.223, StdDeviation   =     9881.425]
#[Max     =    41582.592, Total count    =       143931]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  187689 requests in 1.00m, 16.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
  Non-2xx or 3xx responses: 69046
Requests/sec:   3128.09
Transfer/sec:    281.14KB